# IsManuallyAdjusted Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..IsManuallyAdjusted Method
AnalyticalModel Class See Also
---
Indicates if the Analytical Model has been manually adjusted by the user.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsManuallyAdjusted()
```

Visual Basic
---
```text
Public Function IsManuallyAdjusted As Boolean
```

Visual C++
---
```text
public:
bool IsManuallyAdjusted()
```

# ### Return Value
True if user has manually adjusted the Analytical Model; false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This AnalyticalModel does not support Manual Analytical Adjustment. |

# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace